src/cf/InformationRegisters/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыПлатежногоПоручения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоступленияПоСчету</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетаФактуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/РасчетыСПрочимиКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПрочимиКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СодержаниеПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Comment>АПК:1208</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыДокументовВыплатыСамозанятым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовВыплатыСамозанятым</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЗагружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЧастичноЗагружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ПричиныОтказаВЧекахВыплатСамозанятым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныОтказаВЧекахВыплатСамозанятым</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеКорректныеРеквизитыСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучательНеЯвляетсяСамозанятым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеПричины</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ВыплатыСамозанятым/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает ссылку на скаченный файл чека самозанятого по переданной ссылке
//
// Параметры:
//  СсылкаНаЧек - Строка - URL на чек самозанятого на сайте ФНС
//  ЧекСамозанятого - СправочникСсылка.ВыплатыСамозанятымПрисоединенныеФайлы - Ссылка на присоединенный файл, чтобы можно было его обновить
//  Документ - ДокументСсылка.ВыплатыСамозанятым - Ссылка на документ, к которому присоединется файл
// 
// Возвращаемое значение:
//  СправочникСсылка.ВыплатыСамозанятымПрисоединенныеФайлы - Ссылка на присоединенный файл
//
Функция ЧекСамозанятогоИзИнтернета(СсылкаНаЧек, ЧекСамозанятого, Документ) Экспорт

	URL = СсылкаНаЧек;
	
	ПараметрыПолучения = ПолучениеФайловИзИнтернетаКлиентСервер.ПараметрыПолученияФайла();
	ПараметрыПолучения.Таймаут = 1260;
	
	Результат = ПолучениеФайловИзИнтернета.СкачатьФайлВоВременноеХранилище(URL, ПараметрыПолучения);
	
	Если Результат.Статус Тогда
		ИмяФайла = СтрШаблон(НСтр("ru='№%1'"), НомерЧекаИзСсылки(СсылкаНаЧек));
		Если ЗначениеЗаполнено(ЧекСамозанятого) Тогда
			// Обновим существующий файл
			ИнформацияОФайле = Новый Структура;
			ИнформацияОФайле.Вставить("АдресФайлаВоВременномХранилище", Результат.Путь);
			ИнформацияОФайле.Вставить("АдресВременногоХранилищаТекста", "");
			ИнформацияОФайле.Вставить("ИмяБезРасширения", ИмяФайла);
			ИнформацияОФайле.Вставить("Расширение", "jpg");
			ИнформацияОФайле.Вставить("ДатаМодификацииУниверсальная", ТекущаяУниверсальнаяДата());
			РаботаСФайлами.ОбновитьФайл(ЧекСамозанятого, ИнформацияОФайле);
		Иначе
			// Добавим новый файл
			ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла("Описание");
			ПараметрыФайла.ВладелецФайлов = Документ;
			ПараметрыФайла.ИмяБезРасширения = ИмяФайла;
			ПараметрыФайла.РасширениеБезТочки = "jpg";
			ПараметрыФайла.ВремяИзмененияУниверсальное = ТекущаяУниверсальнаяДата();
			ПараметрыФайла.Служебный = Ложь;
			ЧекСамозанятого = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, Результат.Путь); 
		КонецЕсли;
		
		Возврат ЧекСамозанятого;
	Иначе
		ТекстОшибки = НСтр("ru = 'Не удалось скачать чек самозанятого.
			|Описание: %1
			|URL: %2'");
		Если Результат.Свойство("КодСостояния") Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Код ошибки: %3'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Результат.СообщениеОбОшибке, URL, Результат.КодСостояния);
		Иначе
			ТекстОшибки = СтрШаблон(ТекстОшибки, Результат.СообщениеОбОшибке, URL);
		КонецЕсли;
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Загрузка чеков самозанятых из файла'"), УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	КонецЕсли;

КонецФункции

// Функция возвращает номер чека из ссылки на чек на сайте ФНС
//
// Параметры:
//  СсылкаНаЧек - Строка - URL на чек самозанятого на сайте ФНС
// 
// Возвращаемое значение:
//  Строка - Номер чека
//
Функция НомерЧекаИзСсылки(СсылкаНаЧек) Экспорт
	
	ЧастьСсылкиНаЧек = СтрЗаменить(СсылкаНаЧек, ВыплатыСамозанятымВызовСервераПовтИсп.АдресСервисаФНС(), "");
	МассивЧастейСсылки = СтрРазделить(ЧастьСсылкиНаЧек, "/");

	ИНН = ИННИзСсылкиНаЧек(МассивЧастейСсылки);
	
	НомерЧека = "";
	ПредыдущееЗначение = "";
	СоответствуетУсловиям = Ложь;
	// Номер чека идет после ИНН и перед "print"
	Для Каждого ЧастьСсылки Из МассивЧастейСсылки Цикл
		Если ЗначениеЗаполнено(НомерЧека) И ЧастьСсылки = "print" Тогда
			СоответствуетУсловиям = Истина;
		КонецЕсли;
		Если ПредыдущееЗначение = ИНН Тогда
			НомерЧека = ЧастьСсылки;
		КонецЕсли;
		ПредыдущееЗначение = ЧастьСсылки;
	КонецЦикла;
	Если Не СоответствуетУсловиям Тогда
		НомерЧека = "";
	КонецЕсли;
	
	Возврат НомерЧека;
	
КонецФункции

// Процедура заполняет табличную часть документа из файла в фоне
//
// Параметры:
//    Параметры - Структура - Структура параметров с обязательными ключами:
//                * ЗагруженныеДанные - ТаблицаЗначений - Таблица загруженных данных из файла
//                * РеестрВыплат - ДокументСсылка.ВыплатыСамозанятым - Документ, в который загружаем информацию
//    АдресХранилища - Строка
//
Процедура ЗаполнитьТабличнуюЧасть(Параметры, АдресХранилища) Экспорт
	
	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект = Параметры.РеестрВыплат.ПолучитьОбъект();
	
	ЗаполнитьЧекиСамозанятыхИзЗагруженныхДанных(ДокументОбъект, Параметры.ЗагруженныеДанные);
	
	Попытка
		ДокументОбъект.Записать();
	Исключение
		ТекстИсключенияЗаписи = НСтр("ru = 'Не удалось загрузить чеки самозанятых из файла. 
			|Возможно, документ открыт или редактируется другим пользователем'");
		ВызватьИсключение ТекстИсключенияЗаписи;
	КонецПопытки;
	
КонецПроцедуры

// Выполняет сопоставление контрагентов по данным из файла и контрагентов из табличной части документа "Выплаты самозанятым".
//
// Параметры:
//   ДанныеИзФайла - ТаблицаЗначений - Таблица загруженных данных из файла.
//   ИсходныйМассивКонтрагентов - Массив - Контрагенты из табличной части документа "Выплаты самозанятым".
//
Процедура ОпределитьКонтрагентовПоДаннымФайла(ДанныеИзФайла, ИсходныйМассивКонтрагентов) Экспорт
	
	// Определим контрагентов по данным из файла
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИсходныйМассивКонтрагентов", ИсходныйМассивКонтрагентов);
	Запрос.УстановитьПараметр("ВТ_ДанныеИзФайла", ДанныеИзФайла);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.ИНН КАК ИНН,
	|	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
	|	Контрагенты.Наименование КАК Наименование
	|ПОМЕСТИТЬ ИсходныеКонтрагенты
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В(&ИсходныйМассивКонтрагентов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеИзФайла.ИНН КАК ИНН,
	|	ДанныеИзФайла.ПолноеНаименование КАК ПолноеНаименование
	|ПОМЕСТИТЬ ТаблицаДанныеИзФайла
	|ИЗ
	|	&ВТ_ДанныеИзФайла КАК ДанныеИзФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныеИзФайла.ИНН КАК ИНН,
	|	ТаблицаДанныеИзФайла.ПолноеНаименование КАК ПолноеНаименование,
	|	ИсходныеКонтрагентыПоИНН.Ссылка КАК КонтрагентПоИНН,
	|	ИсходныеКонтрагентыПоПолномуНаименованию.Ссылка КАК КонтрагентПоПолномуНаименованию,
	|	ИсходныеКонтрагентыПоНаименованию.Ссылка КАК КонтрагентПоНаименованию
	|ИЗ
	|	ТаблицаДанныеИзФайла КАК ТаблицаДанныеИзФайла
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсходныеКонтрагенты КАК ИсходныеКонтрагентыПоИНН
	|		ПО ТаблицаДанныеИзФайла.ИНН = ИсходныеКонтрагентыПоИНН.ИНН
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсходныеКонтрагенты КАК ИсходныеКонтрагентыПоПолномуНаименованию
	|		ПО ТаблицаДанныеИзФайла.ПолноеНаименование = ИсходныеКонтрагентыПоПолномуНаименованию.НаименованиеПолное
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсходныеКонтрагенты КАК ИсходныеКонтрагентыПоНаименованию
	|		ПО ТаблицаДанныеИзФайла.ПолноеНаименование = ИсходныеКонтрагентыПоНаименованию.Наименование";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не (ЗначениеЗаполнено(Выборка.КонтрагентПоИНН) 
			Или ЗначениеЗаполнено(Выборка.КонтрагентПоПолномуНаименованию)
			Или ЗначениеЗаполнено(Выборка.КонтрагентПоНаименованию)) Тогда
			// Ничего не нашли
			Продолжить;
		КонецЕсли;
		
		СтрокиДанных = ДанныеИзФайла.НайтиСтроки(Новый Структура("ИНН, ПолноеНаименование", Выборка.ИНН, Выборка.ПолноеНаименование));
		// Строк может быть несколько
		Для Каждого СтрокаДанных Из СтрокиДанных Цикл
			Если ЗначениеЗаполнено(Выборка.КонтрагентПоИНН) Тогда
				СтрокаДанных.Контрагент = Выборка.КонтрагентПоИНН;
			ИначеЕсли ЗначениеЗаполнено(Выборка.КонтрагентПоПолномуНаименованию) Тогда
				СтрокаДанных.Контрагент = Выборка.КонтрагентПоПолномуНаименованию;
			Иначе
				СтрокаДанных.Контрагент = Выборка.КонтрагентПоНаименованию;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Получает ИНН контрагента из ссылки на чек самозанятого.
//
// Параметры:
//   МассивЧастейСсылки - Массив - Массив, полученный в результате разделения ссылки на чек по символу "/".
//
Функция ИННИзСсылкиНаЧек(МассивЧастейСсылки) Экспорт

	ИНН = "";
	Для Каждого ЧастьСсылки Из МассивЧастейСсылки Цикл
		Результат = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(ЧастьСсылки, Ложь);
		Если Результат.СоответствуетТребованиям Тогда
			ИНН = ЧастьСсылки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИНН;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодготовитьУстановитьСостояниеДокументаПриОплате(ДокументСсылкаРасходСоСчета)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхРеквизитов = ""
		+ "Ссылка,"                    // <ДокументСсылка>
		+ "Организация,"               // <СправочникСсылка.Организации>
		+ "РеестрВыплатСамозанятым,"   // <ДокументСсылка.ВыплатыСамозанятым> - реестр, по которому производятся выплаты
		+ "СуммаДокумента";            // <Сумма> - Сумма оплаты
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылкаРасходСоСчета, СписокОбязательныхРеквизитов);
	
	Возврат Реквизиты;
	
КонецФункции

Процедура УстановитьСостояниеДокументаПриОплате(ДокументСсылкаРасходСоСчета, Движения, Отказ) Экспорт
	
	Реквизиты = ПодготовитьУстановитьСостояниеДокументаПриОплате(ДокументСсылкаРасходСоСчета);
	
	МассивДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Реквизиты.РеестрВыплатСамозанятым);
	КоллекцияСтатусов = РегистрыСведений.СтатусыДокументов.ПолучитьСтатусыДокументов(МассивДокументов);
	ТекущийСтатус = ?(КоллекцияСтатусов[Реквизиты.РеестрВыплатСамозанятым] <> Неопределено, 
		КоллекцияСтатусов[Реквизиты.РеестрВыплатСамозанятым].Статус,
		Неопределено);
	Если ТекущийСтатус <> Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЗагружены 
		И ТекущийСтатус <> Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЧастичноЗагружены
		И ТекущийСтатус <> Перечисления.СтатусыДокументовВыплатыСамозанятым.Оплачено Тогда
		Если РеестрПолностьюОплачен(
			Реквизиты.РеестрВыплатСамозанятым, Реквизиты.Организация, Реквизиты.СуммаДокумента, Реквизиты.Ссылка) Тогда
				НовыйСтатус = Перечисления.СтатусыДокументовВыплатыСамозанятым.Оплачено;
			Иначе
				НовыйСтатус = Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧастичноОплачено;
			КонецЕсли;
			НовыеСтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
			НовыеСтатусыДокумента.Статус = НовыйСтатус;
			РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокумента(
				Реквизиты.РеестрВыплатСамозанятым,
				НовыеСтатусыДокумента);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЧекиСамозанятыхИзЗагруженныхДанных(Документ, ЗагруженныеДанные) Экспорт
	
	Для Каждого СтрокаДанных Из ЗагруженныеДанные Цикл
		
		Если СтрокаДанных.НомерСтрокиТабличнойЧасти = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаВыплаты = Документ.Выплаты[СтрокаДанных.НомерСтрокиТабличнойЧасти - 1];
			
		СтрокаВыплаты.НомерЧека = НомерЧекаИзСсылки(СтрокаДанных.СсылкаНаЧек);
		СтрокаВыплаты.СсылкаНаЧек = СтрокаДанных.СсылкаНаЧек;
			
		СтрокаВыплаты.ЧекСамозанятого = ЧекСамозанятогоИзИнтернета(
		СтрокаДанных.СсылкаНаЧек, СтрокаВыплаты.ЧекСамозанятого, Документ.Ссылка);
		
		Если ЗагруженныеДанные.Колонки.Найти("Результат") <> Неопределено Тогда 
			
			Если НРег(СокрЛП(СтрокаДанных.Результат)) = НРег("НеЗачисленоНеКорректныеРеквизитыСчета") Тогда
				СтрокаВыплаты.ПричинаОтказа = Перечисления.ПричиныОтказаВЧекахВыплатСамозанятым.НеКорректныеРеквизитыСчета;
			ИначеЕсли НРег(СокрЛП(СтрокаДанных.Результат)) = НРег("НеЗачисленоПолучательНеЯвляетсяСамозанятым") Тогда
				СтрокаВыплаты.ПричинаОтказа = Перечисления.ПричиныОтказаВЧекахВыплатСамозанятым.ПолучательНеЯвляетсяСамозанятым;
			ИначеЕсли (НРег(СокрЛП(СтрокаДанных.Результат)) <> НРег("Зачислено"))
				И (НРег(СокрЛП(СтрокаДанных.Результат)) <> НРег("ЗачисленоСсылкаНеСформирована")) Тогда
				СтрокаВыплаты.ПричинаОтказа = Перечисления.ПричиныОтказаВЧекахВыплатСамозанятым.ПрочиеПричины;
			КонецЕсли;
			
		КонецЕсли;
		Если ЗагруженныеДанные.Колонки.Найти("РасшифровкаРезультата") <> Неопределено Тогда 
			
			СтрокаВыплаты.РасшифровкаРезультата = СтрокаДанных.РасшифровкаРезультата;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РеестрПолностьюОплачен(Реестр, Организация, Сумма, Регистратор)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Реестр);
	Запрос.УстановитьПараметр("Период", Новый Граница(Регистратор.МоментВремени(), ВидГраницы.Исключая));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадолженностьСамозанятыхПоРееструОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыСПрочимиКонтрагентами.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И Документ = &Ссылка) КАК ЗадолженностьСамозанятыхПоРееструОстатки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	РеестрПолностьюОплачен = Ложь;
	Если Выборка.Следующий() Тогда
		// При проведении еще не учтена сумма этого документа,
		// поэтому вычтем сумму документа из остатка
		Если Выборка.СуммаОстаток - Сумма <= 0 Тогда
			РеестрПолностьюОплачен = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РеестрПолностьюОплачен;
	
КонецФункции 

Функция ФИОСамозанятых() Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.ФИО КАК ФИО
	|ИЗ
	|	(ВЫБРАТЬ
	|		Контрагенты.Наименование КАК ФИО
	|	ИЗ
	|		Справочник.Контрагенты КАК Контрагенты
	|	ГДЕ
	|		Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|		И Контрагенты.Самозанятый
	|		И НЕ Контрагенты.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(1000))
	|	ИЗ
	|		Справочник.Контрагенты КАК Контрагенты
	|	ГДЕ
	|		Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|		И Контрагенты.Самозанятый
	|		И НЕ Контрагенты.ПометкаУдаления) КАК ВложенныйЗапрос";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ФИО) Тогда
			Результат.Добавить(СокрЛП(Выборка.ФИО));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
